<?php
// +----------------------------------------------------------------------
// | 模板設定
// +----------------------------------------------------------------------

return [
    // 模板引擎型別使用Think
    'type'          => 'Think',
    // 預設模板渲染規則 1 解析為小寫+下劃線 2 全部轉換小寫 3 保持操作方法
    'auto_rule'     => 1,
    // 模板目錄名
    'view_dir_name' => 'view',
    // 模板字尾
    'view_suffix'   => 'html',
    // 模板檔名分隔符
    'view_depr'     => DIRECTORY_SEPARATOR,
    // 模板引擎普通標籤開始標記
    'tpl_begin'     => '{',
    // 模板引擎普通標籤結束標記
    'tpl_end'       => '}',
    // 標籤庫標籤開始標記
    'taglib_begin'  => '{',
    // 標籤庫標籤結束標記
    'taglib_end'    => '}',
];
